jeanlemotan/esp32-cam-fpv/air_firmware/components/esp32-camera/driver/camera.c
    // wait for frame
    //camera_fb_int_t * fb = s_state->fb;

    //todo: wait for vsync
    ESP_LOGV(TAG, "Waiting for negative edge on VSYNC");

    int64_t st_t = esp_timer_get_time();
    while (_gpio_get_level(s_state->config.pin_vsync) != 0) {
        if((esp_timer_get_time() - st_t) > 1000000LL){
            ESP_LOGE(TAG, "Timeout waiting for VSYNC");
            return -1;
        }
    }
    ESP_LOGV(TAG, "Got VSYNC");
    i2s_start_bus();
    return 0;
}

static void IRAM_ATTR i2s_stop_bus()
{
    esp_intr_disable(s_state->i2s_intr_handle);
    vsync_intr_disable();
    i2s_conf_reset();
    I2S0.conf.rx_start = 0;
}

static void IRAM_ATTR i2s_stop(bool* need_yield)
{
    s_state->dma_received_count = 0;

    size_t val = SIZE_MAX;
    BaseType_t higher_priority_task_woken;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &val, &higher_priority_task_woken);
    if(need_yield && !*need_yield) {
        *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
    }
}

static void IRAM_ATTR signal_dma_buf_received(bool* need_yield, bool last)
{
    size_t dma_desc_filled = s_state->dma_desc_cur;
    s_state->dma_desc_cur = (dma_desc_filled + 1) % s_state->dma_desc_count;
    s_state->dma_received_count++;
    if(s_state->fb->bad){
        *need_yield = false;
        return;
    }
    BaseType_t higher_priority_task_woken;
    if (last)
        dma_desc_filled |= 0x80000000;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &dma_desc_filled, &higher_priority_task_woken);
    if (ret != pdTRUE) {
        s_state->fb->bad = 1;
        //ESP_EARLY_LOGW(TAG, "qsf:%d", s_state->dma_received_count);
        //ets_printf("qsf:%d\n", s_state->dma_received_count);
        //ets_printf("qovf\n");
    }
    *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
}

static void IRAM_ATTR i2s_isr(void* arg)
{
    I2S0.int_clr.val = I2S0.int_raw.val;
    bool need_yield = false;
    signal_dma_buf_received(&need_yield, false);
    if (s_state->config.pixel_format != PIXFORMAT_JPEG
     && s_state->dma_received_count == s_state->height * s_state->dma_per_line) {
        i2s_stop(&need_yield);
    }
    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR vsync_isr(void* arg)
{
    GPIO.status1_w1tc.val = GPIO.status1.val;
    GPIO.status_w1tc = GPIO.status;
    bool need_yield = false;
    //if vsync is low and we have received some data, frame is done
    if (_gpio_get_level(s_state->config.pin_vsync) == 0) {
        if(s_state->dma_received_count > 0) {
            signal_dma_buf_received(&need_yield, true);
            //ets_printf("end_vsync\n");
            i2s_stop(&need_yield);
            //ets_printf("vs\n");
        }
        I2S0.conf.rx_start = 0;
        I2S0.in_link.start = 0;
        I2S0.int_clr.val = I2S0.int_raw.val;
        i2s_conf_reset();
        s_state->dma_desc_cur = (s_state->dma_desc_cur + 1) % s_state->dma_desc_count;
        //I2S0.rx_eof_num = s_state->dma_sample_count;
        I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[s_state->dma_desc_cur];
        I2S0.in_link.start = 1;
        I2S0.conf.rx_start = 1;
        s_state->dma_received_count = 0;
    }
    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR camera_fb_done()
{
    //advance frame buffer only if the current one has data
    if(s_state->fb->len) {
        s_state->fb = s_state->fb->next;
    }
    //buffer found. make sure it's empty
    s_state->fb->len = 0;
}

static void IRAM_ATTR dma_finish_frame()
{
    size_t buf_len = s_state->width * s_state->fb_bytes_per_pixel / s_state->dma_per_line;

    // is the frame bad?
    if(s_state->fb->bad){
        s_state->fb->bad = 0;
        s_state->fb->len = 0;
        //ets_printf("bad\n");
    } else {
        s_state->fb->len = s_state->dma_filtered_count * buf_len;
        if(s_state->fb->len) {
            //send out the frame
            s_cb(NULL, 0, 0, true);
            camera_fb_done();
        }
    }
    s_state->dma_filtered_count = 0;
}

static void IRAM_ATTR dma_filter_buffer(size_t buf_idx, bool last)
{
    //no need to process the data if frame is in use or is bad
    if(s_state->fb->bad) {
        return;
    }

    //check if there is enough space in the frame buffer for the new data
    size_t buf_len = s_state->width * s_state->fb_bytes_per_pixel / s_state->dma_per_line;
    //size_t fb_pos = s_state->dma_filtered_count * buf_len;
    // if(fb_pos > s_state->fb_size - buf_len) {
    //     //size_t processed = s_state->dma_received_count * buf_len;
    //     //ets_printf("[%s:%u] ovf pos: %u, processed: %u\n", __FUNCTION__, __LINE__, fb_pos, processed);
    //     return;
    // }

    if (!s_state->dma_filtered_count) {
        s_cb(NULL, 0, 0, false); //start frame
    }

    {
        const uint8_t* src = ((const uint8_t*)s_state->dma_buf[buf_idx]) + 2; //starting at sample1 field
        size_t count = buf_len;//s_state->dma_desc[buf_idx].length / sizeof(dma_elem_t);
        size_t stride = sizeof(dma_elem_t);
        s_cb(src, stride, count, last);
    }

    //first frame buffer
    if(!s_state->dma_filtered_count) {
        //set the frame properties
        s_state->fb->width = resolution[s_state->sensor.status.framesize].width;
        s_state->fb->height = resolution[s_state->sensor.status.framesize].height;
        s_state->fb->format = s_state->sensor.pixformat;
    }
    s_state->dma_filtered_count++;
}

static void IRAM_ATTR dma_filter_task(void *pvParameters)
{
    s_state->dma_filtered_count = 0;
    while (true) {
        size_t buf_idx;
        if(xQueueReceive(s_state->data_ready, &buf_idx, portMAX_DELAY) == pdTRUE) {
            if (buf_idx == SIZE_MAX) {
                //this is the end of the frame
                dma_finish_frame();
            } else {
                bool last = buf_idx & 0x80000000;
                buf_idx &= 0x7FFFFFFF;
                dma_filter_buffer(buf_idx, last);
            }
        }
    }
}

